Unix/unix-shell.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Hohenstein)"/>
<link rel="stylesheet" href="file:///Users/hohenstein/tomuments/templates/revealjs/css/reveal.css"/>

<link rel="stylesheet" href="file:///Users/hohenstein/tomuments/templates/revealjs/css/theme/nu-library.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">

<section>
<section id="slide-orgb1c7e12">
<h2 id="orgb1c7e12">The Unix Shell - Introducing the Shell</h2>
<p>
with Tom Hohenstein 
</p>

</section>
<section id="slide-org9595d90">
<h3 id="org9595d90">Logistics</h3>
<ul>
<li>Bathrooms</li>
<li>Internet</li>
<li>Terminals ready?</li>
<li>Other &#x2026; ?</li>

</ul>

</section>
<section id="slide-orgae37b7f">
<h3 id="orgae37b7f">Intentions</h3>
<ul>
<li>Introduce the shell</li>
<li>Learn to navigate and work with files and directories</li>
<li>Pipes and filters</li>
<li>Loops</li>
<li>Scripts (hopefully)</li>
<li>finding things (hopefully)</li>

</ul>

</section>
<section id="slide-orgbf8e376">
<h3 id="orgbf8e376">Assumptions</h3>
<ul>
<li>The terminal up and ready to go (with files downloaded)</li>
<li>Little, maybe no experience, with the shell</li>
<li>Willing to ask questions</li>
<li>data-shell folder is on your Desktop</li>

</ul>

</section>
<section id="slide-orgecd860d">
<h3 id="orgecd860d">Quick Note</h3>
<p>
If you already know how to use grep and find, this session might
only be a refresher. If you're willing, please help new learners. 
</p>


</section>
</section>
<section>
<section id="slide-orgfa046a1">
<h2 id="orgfa046a1">What is the shell?</h2>
<p>
A "shell" around the operating system that hides some its complexity
and makes it easier for us to interact with. 
</p>

<p>
We'll be using the Bourne Again SHell (BASH) written by Stephen
Bourne. The default shell on most unix systems. 
</p>

</section>
<section id="slide-org443ea69">
<h3 id="org443ea69">Command-line interface (CLI)</h3>
<p>
Read-Evaluate-Print Loop (REPL) 
</p>

<p>
The user provides the computer a command. The computer reads it,
executes it, and prints its output. 
</p>

</section>
<section id="slide-org662dcaa">
<h3 id="org662dcaa">Why bother</h3>
<p>
Automation! 
</p>

<p>
While commands can feel terse and complex at first, our ability to
chain them together to perform common, routine (yet complex) tasks
is surprising powerful. (and it creates reproducible workflows) 
</p>

</section>
<section id="slide-org0580fee">
<h3 id="org0580fee">Case study Nelle</h3>
<p>
Nelle, a marine biologist, has a bunch of data to analyze using two
programs - goostats and goodiff. If she does this by hand, she'll
have click and open files about 46,370 times. 
</p>

<p>
There must be a better way&#x2026; 
</p>

</section>
</section>
<section>
<section id="slide-orgc3fb3d3">
<h2 id="orgc3fb3d3">Navigating Files and Directories</h2>
<div class="outline-text-2" id="text-orgc3fb3d3">
</div>
</section>
<section id="slide-orga830eb2">
<h3 id="orga830eb2">Preparation Magic</h3>
<p>
This will help ensure our terminals look the same 
</p>

<div class="org-src-container">

<pre  class="src src-unix">PS1='$ ' 
</pre>
</div>

</section>
<section id="slide-orgd7ab167">
<h3 id="orgd7ab167">Our first command</h3>
<div class="org-src-container">

<pre  class="src src-unix">whoami 
</pre>
</div>

</section>
<section id="slide-org876f0c4">
<h3 id="org876f0c4">Our first failure</h3>
<div class="org-src-container">

<pre  class="src src-unix">tom
</pre>
</div>

</section>
<section id="slide-orge2260de">
<h3 id="orge2260de">Quick Note</h3>
<p>
Unix is great at giving negative feedback. Don't take it personally :
) 
</p>

</section>
<section id="slide-orgfab3543">
<h3 id="orgfab3543">Where are we</h3>
<p>
(print working directory) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">pwd 
</pre>
</div>

</section>
<section id="slide-org182727b">
<h3 id="org182727b">What is happening?</h3>
<p>
(quick answer) 
</p>

</section>
<section id="slide-orgd45226b">
<h3 id="orgd45226b">List</h3>
<p>
(list directory contents) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">ls 
</pre>
</div>

</section>
<section id="slide-org1db9a7f">
<h3 id="org1db9a7f">Getting Help</h3>
<p>
Mac and Unix - use "man" plus program (man is short for manual) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">man ls 
</pre>
</div>

<p>
Windows: Visit <a href="http://man.he.net/y">http://man.he.net/y</a>
</p>

</section>
<section id="slide-org9d86abf">
<h3 id="org9d86abf">Hit q to exit</h3>
</section>
<section id="slide-orgc0409b3">
<h3 id="orgc0409b3">Commands, Options, and Arguments</h3>
<p>
Tricky things to grasp but think of the general Unix command structure
as: 
</p>

<div class="org-src-container">

<pre  class="src src-talking-point">command -option -option /directory-argument 
</pre>
</div>

</section>
<section id="slide-orgccb38f9">
<h3 id="orgccb38f9">LS Example Option 1</h3>
<p>
(list in the long format)
</p>

<div class="org-src-container">

<pre  class="src src-unix">ls -l 
</pre>
</div>

</section>
<section id="slide-org7082869">
<h3 id="org7082869">LS Example Option 2</h3>
<p>
(list with directory slashes) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">ls -F 
</pre>
</div>

</section>
<section id="slide-org0f2203c">
<h3 id="org0f2203c">LS Example Option 3</h3>
<p>
(list all and directory slashes) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">ls  -a -F
</pre>
</div>

<p>
OR 
</p>

<div class="org-src-container">

<pre  class="src src-unix">ls -aF 
</pre>
</div>

</section>
<section id="slide-org56fcf63">
<h3 id="org56fcf63">Let's fail again</h3>
<div class="org-src-container">

<pre  class="src src-unix">ls -j
</pre>
</div>

</section>
<section id="slide-org59fe7a0">
<h3 id="org59fe7a0">Activity</h3>
<p>
(think, pair, share) 
</p>

<p>
What will the following do? 
</p>

<p>
#1
</p>
<div class="org-src-container">

<pre  class="src src-unix">ls -l -h 
</pre>
</div>

<p>
#2 
</p>
<div class="org-src-container">

<pre  class="src src-unix">ls -R -t
</pre>
</div>

</section>
<section id="slide-org4d07bab">
<h3 id="org4d07bab">LS Example 4</h3>
<p>
You can use ls to see the listing of any directory
</p>

<div class="org-src-container">

<pre  class="src src-unix">ls data 
</pre>
</div>

<p>
and 
</p>

<div class="org-src-container">

<pre  class="src src-unix">ls data/elements 
</pre>
</div>

</section>
<section id="slide-org3a1ca00">
<h3 id="org3a1ca00">Reset</h3>
<p>
What directory are we all in? 
</p>

<div class="org-src-container">

<pre  class="src src-unix">pwd 
</pre>
</div>

<p>
Let's move to the same location 
</p>

<div class="org-src-container">

<pre  class="src src-unix">cd ~/Desktop/data-shell 
</pre>
</div>

</section>
<section id="slide-org9014b6e">
<h3 id="org9014b6e">cd</h3>
<p>
(change directory) 
</p>

<div class="org-src-container">

<pre  class="src src-talking-point">cd [add your directory path here]
</pre>
</div>

</section>
<section id="slide-org3cdd085">
<h3 id="org3cdd085">Interesting point(s)</h3>
<p>
What do the following do? 
</p>
<div class="org-src-container">

<pre  class="src src-unix">cd . 
</pre>
</div>

<p>
and
</p>
<div class="org-src-container">

<pre  class="src src-unix">cd .. 
</pre>
</div>

</section>
<section id="slide-orgd0a8ce2">
<h3 id="orgd0a8ce2">Wait there's more!</h3>
<p>
Try 
</p>
<div class="org-src-container">

<pre  class="src src-unix">cd
</pre>
</div>

</section>
<section id="slide-org3662f2a">
<h3 id="org3662f2a">~, -, tab complete</h3>
<p>
"~" -&gt; current users home directory 
</p>

<p>
"-" -&gt; last directory (like last channel) 
</p>

<p>
hit tab to auto complete
</p>

<div class="org-src-container">

<pre  class="src src-unix">cd ~/Desktop/data-shell 
</pre>
</div>

</section>
<section id="slide-orga8c74b0">
<h3 id="orga8c74b0">Relative and Absolute Paths</h3>
<p>
Go to absolute and relative path diagram at:
<a href="https://swcarpentry.github.io/shell-novice/02-filedir/">https://swcarpentry.github.io/shell-novice/02-filedir/</a>
</p>

</section>
<section id="slide-orgd44ef6a">
<h3 id="orgd44ef6a">mkdir</h3>
<p>
(make directory) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">mkdir thesis
</pre>
</div>

</section>
<section id="slide-org5ff4f73">
<h3 id="org5ff4f73">A note on naming things</h3>
<ul>
<li>Don't use whitespaces</li>
<li>Don't begin with "-"</li>
<li>Stick with letters, numbers, . (period), - (dash) and _ (underscore)</li>
<li>(Tom's) Avoid multiple "." (only use before file extension)</li>

</ul>

</section>
<section id="slide-org1aeefb1">
<h3 id="org1aeefb1">Start writing</h3>
<p>
Move into "thesis" 
</p>

<div class="org-src-container">

<pre  class="src src-unix">nano draft.txt 
</pre>
</div>

</section>
<section id="slide-org5c60cfa">
<h3 id="org5c60cfa">Nano</h3>
<ul>
<li>^x -&gt; Control-X or Ctrl-X (exit)</li>
<li>^o -&gt; Control-O or Ctrl-O (write-out)</li>

</ul>

</section>
<section id="slide-orged133af">
<h3 id="orged133af">rm</h3>
<p>
(remove) 
</p>

<p>
STOP! This is the real deal. No trash bins or what-have-you. Once it
is gone, it is gone. 
</p>

</section>
<section id="slide-orgc52965c">
<h3 id="orgc52965c">rm</h3>
<p>
(remove) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">rm  draft.txt 
</pre>
</div>

</section>
<section id="slide-org3d07881">
<h3 id="org3d07881">rm recursively</h3>
<p>
Hey - you probably don't want to do this. Just saying&#x2026; 
</p>

<div class="org-src-container">

<pre  class="src src-unix">rm -r draft.txt 
</pre>
</div>

<p>
or add -i for interactive 
</p>
<div class="org-src-container">

<pre  class="src src-unix">rm -r -i draft.txt 
</pre>
</div>

</section>
<section id="slide-orga6ff5bc">
<h3 id="orga6ff5bc">mv</h3>
<p>
(move) (or rename) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">mv draft.txt quotes.txt
</pre>
</div>

<p>
Be careful about naming! mv will overwrite a file if it exists. Use -i
for interactive to help avoid this. 
</p>

</section>
<section id="slide-org78e2fde">
<h3 id="org78e2fde">cp</h3>
<p>
(copy) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">cp quotes.txt draft.txt 
</pre>
</div>

</section>
