Unix/unix-shell.org
** Exercise 
(think pair share) 

Renaming Files on 
https://swcarpentry.github.io/shell-novice/03-create/

and moving and copying at
https://swcarpentry.github.io/shell-novice/03-create/

* Pipes and Filters 
** Let's move 
to the molecules directory
** wc 
(word count) 

#+BEGIN_SRC unix 
wc *.pdb 
#+END_SRC

** Wildcards 

+ * -> zero or more characters 
+ ? -> exactly one character 

** more wc 

+ -l -> lines 
+ -c -> characters (windows) 
+ -m -> characters (mac) 
+ -w -> words 

#+BEGIN_SRC unix 
wc -l *.pdb 
#+END_SRC

** > 
(redirect) 

#+BEGIN_SRC unix 
wc -l *.pdb > lengths.txt 
#+END_SRC

(don't redirect back to the same file, you'll have issues) 

** >>

What does >> do? 

#+BEGIN_SRC unix 
echo hi >> test.txt 
#+END_SRC

** cat 
(concatenate and print) 

#+BEGIN_SRC unix 
cat lengths.txt 
#+END_SRC

(there is also "less") 

** sort 
(sort) 

#+BEGIN_SRC unix 
sort -n lengths.txt 
#+END_SRC

and 
#+BEGIN_SRC unix 
sort -n lengths.txt > sorted-lengths.txt
#+END_SRC

** head 
(head of the file) 

#+BEGIN_SRC unix 
head -n 1 sorted-lengths.txt
#+END_SRC

** | 
(pipes) 

You can connect commands with pipes 

#+BEGIN_SRC unix 
 wc -l *.pdb | sort -n
#+END_SRC
 
and ... 

#+BEGIN_SRC unix 
wc -l *.pdb | sort -n | head -n 1
#+END_SRC

** Standard in and out 

use diagram at 
https://swcarpentry.github.io/shell-novice/04-pipefilter/

** Nelle's Pipeline 
(let's check-in on Nelle) 

#+BEGIN_SRC unix 
cd north-pacific-gyre/2012-07-03
wc -l *.txt
#+END_SRC

** Data check 

#+BEGIN_SRC unix 
wc -l *.txt | sort -n | head -n 5
#+END_SRC

(something is up) 

** Let's check the tail 

#+BEGIN_SRC unix 
wc -l *.txt | sort -n | tail -n 5
#+END_SRC

(what's that Z?)

** more digging 

#+BEGIN_SRC unix 
ls *Z.txt
#+END_SRC

** a little regular expression 
 
To target the AB files 

#+BEGIN_SRC unix 
ls *[AB].txt
#+END_SRC


* Loops 

Looping our way to productivity 

** let's get to the same place 

#+BEGIN_SRC unix 
cd ~/Desktop/data-shell/creatures/
#+END_SRC

** Let's make a backup 

#+BEGIN_SRC talking-point
cp *.dat original-*.dat
#+END_SRC

Oh no! That didn't work because it expands to 

#+BEGIN_SRC talking-point
cp basilisk.dat unicorn.dat original-*.dat
#+END_SRC

** But we can loop 
(talk through the looping process) 

#+BEGIN_SRC talking-point
for [variable] in [list]
> do
>    head -n 3 $[variable]
> done

#+END_SRC

** Example 1

#+BEGIN_SRC unix 
for filename in basilisk.dat unicorn.dat
> do
>    head -n 3 $filename
> done
#+END_SRC

** > and > 

Same symbols but they have different meanings in different contexts. 

** Example 2

#+BEGIN_SRC unix 
for filename in *.dat 
> do
>    echo $filename 
>    head -n 3 $filename
> done
#+END_SRC

** Hit the up key Tom 

Show different syntax 

** A note about white spaces in file names 

** Solving our copying problem 

#+BEGIN_SRC unix 
for filename in *.dat 
> do
>    cp $filename original-$filename 
> done
#+END_SRC

** history 
(see your last commands) 

#+BEGIN_SRC unix
history | tail -n 5 
#+END_SRC

! command number to rerun 

** Other fun stuff 

  + ctrl-a and ctrl-e - move to front and end of terminal line 
  + ctrl-r - reverse search commands  
  + !! - last command (same as up arrow) 
  + !$ - last work of last command 

** Nelle's Pipeline 
   move to north-pacific-gyre/2012-07-03

** Step 1 

#+BEGIN_SRC unix
for datafile in NENE*[AB].txt
> do
>     echo $datafile
> done
#+END_SRC

** Step 2 
#+BEGIN_SRC unix
for datafile in NENE*[AB].txt
> do
>     echo $datafile stats-$datafile
> done
#+END_SRC

** Step 3
#+BEGIN_SRC unix
for datafile in NENE*[AB].txt
> do
>     echo $datafile 
>     bash goostats $datafile stats-$datafile
> done
#+END_SRC

** Check on learning 

Doing a dry run at: 
https://swcarpentry.github.io/shell-novice/05-loop/


* Scripts 
Making the computer work for us. 

** Move to the molecules folder 

** create middle.sh 

#+BEGIN_SRC unix
head -n 15 octane.pdb | tail -n 5
#+END_SRC

to run it 
#+BEGIN_SRC unix
bash middle.sh 
#+END_SRC

** let's add a variable 

#+BEGIN_SRC unix
head -n 15 "$1" | tail -n 5
#+END_SRC

to run it 
#+BEGIN_SRC unix
bash middle.sh octane.pdb 
#+END_SRC

** more variables 

#+BEGIN_SRC unix
head -n "$2" "$1" | tail -n "$3" 
#+END_SRC

to run it 
#+BEGIN_SRC unix
bash middle.sh octane.pdb 15 5
#+END_SRC
 
** comments for documentation 

#+BEGIN_SRC unix
# Select lines from the middle of a file.
# Usage: bash middle.sh filename end_line num_lines 
#+END_SRC

** more than one file
(a special variable "$@") 

create a new file called sorted.sh

#+BEGIN_SRC unix
# Sort filenames by their length.
# Usage: bash sorted.sh one_or_more_filenames
wc -l "$@" | sort -n
#+END_SRC

** give it a try  

#+BEGIN_SRC unix
bash sorted.sh *.pdb ../creatures/*.dat
#+END_SRC

** let's fail again  

#+BEGIN_SRC unix
bash sorted.sh
#+END_SRC

** saving experiments 

#+BEGIN_SRC unix
history | tail -n 5 > redo-figure-3.sh
#+END_SRC

** Back to Nelle 
(and the north-pacific-gyre/2017-07-03/) 

Let's create a script do-stats.sh

