Unix/unix-shell.html
<section id="slide-org33953d5">
<h3 id="org33953d5">Exercise</h3>
<p>
(think pair share) 
</p>

<p>
Renaming Files on 
<a href="https://swcarpentry.github.io/shell-novice/03-create/">https://swcarpentry.github.io/shell-novice/03-create/</a>
</p>

<p>
and moving and copying at
<a href="https://swcarpentry.github.io/shell-novice/03-create/">https://swcarpentry.github.io/shell-novice/03-create/</a>
</p>

</section>
</section>
<section>
<section id="slide-orgd0aaf06">
<h2 id="orgd0aaf06">Pipes and Filters</h2>
<div class="outline-text-2" id="text-orgd0aaf06">
</div>
</section>
<section id="slide-orgc6ec98e">
<h3 id="orgc6ec98e">Let's move</h3>
<p>
to the molecules directory
</p>
</section>
<section id="slide-org7e74728">
<h3 id="org7e74728">wc</h3>
<p>
(word count) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">wc *.pdb 
</pre>
</div>

</section>
<section id="slide-org127e028">
<h3 id="org127e028">Wildcards</h3>
<ul>
<li>* -&gt; zero or more characters</li>
<li>? -&gt; exactly one character</li>

</ul>

</section>
<section id="slide-org74d9703">
<h3 id="org74d9703">more wc</h3>
<ul>
<li>-l -&gt; lines</li>
<li>-c -&gt; characters (windows)</li>
<li>-m -&gt; characters (mac)</li>
<li>-w -&gt; words</li>

</ul>

<div class="org-src-container">

<pre  class="src src-unix">wc -l *.pdb 
</pre>
</div>

</section>
<section id="slide-orgdfc61ef">
<h3 id="orgdfc61ef">&gt;</h3>
<p>
(redirect) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">wc -l *.pdb &gt; lengths.txt 
</pre>
</div>

<p>
(don't redirect back to the same file, you'll have issues) 
</p>

</section>
<section id="slide-org5b32522">
<h3 id="org5b32522">&gt;&gt;</h3>
<p>
What does &gt;&gt; do? 
</p>

<div class="org-src-container">

<pre  class="src src-unix">echo hi &gt;&gt; test.txt 
</pre>
</div>

</section>
<section id="slide-orgfb698e7">
<h3 id="orgfb698e7">cat</h3>
<p>
(concatenate and print) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">cat lengths.txt 
</pre>
</div>

<p>
(there is also "less") 
</p>

</section>
<section id="slide-org9fb8aba">
<h3 id="org9fb8aba">sort</h3>
<p>
(sort) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">sort -n lengths.txt 
</pre>
</div>

<p>
and 
</p>
<div class="org-src-container">

<pre  class="src src-unix">sort -n lengths.txt &gt; sorted-lengths.txt
</pre>
</div>

</section>
<section id="slide-org0ca9265">
<h3 id="org0ca9265">head</h3>
<p>
(head of the file) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">head -n 1 sorted-lengths.txt
</pre>
</div>

</section>
<section id="slide-orgb21a97b">
<h3 id="orgb21a97b">|</h3>
<p>
(pipes) 
</p>

<p>
You can connect commands with pipes 
</p>

<div class="org-src-container">

<pre  class="src src-unix">wc -l *.pdb | sort -n
</pre>
</div>

<p>
and &#x2026; 
</p>

<div class="org-src-container">

<pre  class="src src-unix">wc -l *.pdb | sort -n | head -n 1
</pre>
</div>

</section>
<section id="slide-orge618758">
<h3 id="orge618758">Standard in and out</h3>
<p>
use diagram at 
<a href="https://swcarpentry.github.io/shell-novice/04-pipefilter/">https://swcarpentry.github.io/shell-novice/04-pipefilter/</a>
</p>

</section>
<section id="slide-orgc95e85f">
<h3 id="orgc95e85f">Nelle's Pipeline</h3>
<p>
(let's check-in on Nelle) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">cd north-pacific-gyre/2012-07-03
wc -l *.txt
</pre>
</div>

</section>
<section id="slide-org2b29789">
<h3 id="org2b29789">Data check</h3>
<div class="org-src-container">

<pre  class="src src-unix">wc -l *.txt | sort -n | head -n 5
</pre>
</div>

<p>
(something is up) 
</p>

</section>
<section id="slide-orgb58c659">
<h3 id="orgb58c659">Let's check the tail</h3>
<div class="org-src-container">

<pre  class="src src-unix">wc -l *.txt | sort -n | tail -n 5
</pre>
</div>

<p>
(what's that Z?)
</p>

</section>
<section id="slide-org55039e3">
<h3 id="org55039e3">more digging</h3>
<div class="org-src-container">

<pre  class="src src-unix">ls *Z.txt
</pre>
</div>

</section>
<section id="slide-orgbc168fd">
<h3 id="orgbc168fd">a little regular expression</h3>
<p>
To target the AB files 
</p>

<div class="org-src-container">

<pre  class="src src-unix">ls *[AB].txt
</pre>
</div>


</section>
</section>
<section>
<section id="slide-org3a6cd8c">
<h2 id="org3a6cd8c">Loops</h2>
<p>
Looping our way to productivity 
</p>

</section>
<section id="slide-org19733f5">
<h3 id="org19733f5">let's get to the same place</h3>
<div class="org-src-container">

<pre  class="src src-unix">cd ~/Desktop/data-shell/creatures/
</pre>
</div>

</section>
<section id="slide-org7d0d182">
<h3 id="org7d0d182">Let's make a backup</h3>
<div class="org-src-container">

<pre  class="src src-talking-point">cp *.dat original-*.dat
</pre>
</div>

<p>
Oh no! That didn't work because it expands to 
</p>

<div class="org-src-container">

<pre  class="src src-talking-point">cp basilisk.dat unicorn.dat original-*.dat
</pre>
</div>

</section>
<section id="slide-orgad1edde">
<h3 id="orgad1edde">But we can loop</h3>
<p>
(talk through the looping process) 
</p>

<div class="org-src-container">

<pre  class="src src-talking-point">for [variable] in [list]
&gt; do
&gt;    head -n 3 $[variable]
&gt; done

</pre>
</div>

</section>
<section id="slide-orgdf25868">
<h3 id="orgdf25868">Example 1</h3>
<div class="org-src-container">

<pre  class="src src-unix">for filename in basilisk.dat unicorn.dat
&gt; do
&gt;    head -n 3 $filename
&gt; done
</pre>
</div>

</section>
<section id="slide-org1276897">
<h3 id="org1276897">&gt; and &gt;</h3>
<p>
Same symbols but they have different meanings in different contexts. 
</p>

</section>
<section id="slide-org30c4264">
<h3 id="org30c4264">Example 2</h3>
<div class="org-src-container">

<pre  class="src src-unix">for filename in *.dat 
&gt; do
&gt;    echo $filename 
&gt;    head -n 3 $filename
&gt; done
</pre>
</div>

</section>
<section id="slide-orgb674d68">
<h3 id="orgb674d68">Hit the up key Tom</h3>
<p>
Show different syntax 
</p>

</section>
<section id="slide-org6ecc59d">
<h3 id="org6ecc59d">A note about white spaces in file names</h3>

</section>
<section id="slide-org5d05143">
<h3 id="org5d05143">Solving our copying problem</h3>
<div class="org-src-container">

<pre  class="src src-unix">for filename in *.dat 
&gt; do
&gt;    cp $filename original-$filename 
&gt; done
</pre>
</div>

</section>
<section id="slide-org8f2a70a">
<h3 id="org8f2a70a">history</h3>
<p>
(see your last commands) 
</p>

<div class="org-src-container">

<pre  class="src src-unix">history | tail -n 5 
</pre>
</div>

<p>
! command number to rerun 
</p>

</section>
<section id="slide-org55de08a">
<h3 id="org55de08a">Other fun stuff</h3>
<ul>
<li>ctrl-a and ctrl-e - move to front and end of terminal line</li>
<li>ctrl-r - reverse search commands</li>
<li>!! - last command (same as up arrow)</li>
<li>!$ - last work of last command</li>

</ul>

</section>
<section id="slide-orgf7445d3">
<h3 id="orgf7445d3">Nelle's Pipeline</h3>
<p>
move to north-pacific-gyre/2012-07-03
</p>

</section>
<section id="slide-orgd38dd6c">
<h3 id="orgd38dd6c">Step 1</h3>
<div class="org-src-container">

<pre  class="src src-unix">for datafile in NENE*[AB].txt
&gt; do
&gt;     echo $datafile
&gt; done
</pre>
</div>

</section>
<section id="slide-orgadb3a89">
<h3 id="orgadb3a89">Step 2</h3>
<div class="org-src-container">

<pre  class="src src-unix">for datafile in NENE*[AB].txt
&gt; do
&gt;     echo $datafile stats-$datafile
&gt; done
</pre>
</div>

</section>
<section id="slide-orgd1b4719">
<h3 id="orgd1b4719">Step 3</h3>
<div class="org-src-container">

<pre  class="src src-unix">for datafile in NENE*[AB].txt
&gt; do
&gt;     echo $datafile 
&gt;     bash goostats $datafile stats-$datafile
&gt; done
</pre>
</div>

</section>
<section id="slide-org9fcc033">
<h3 id="org9fcc033">Check on learning</h3>
<p>
Doing a dry run at: 
<a href="https://swcarpentry.github.io/shell-novice/05-loop/">https://swcarpentry.github.io/shell-novice/05-loop/</a>
</p>


</section>
</section>
<section>
<section id="slide-orge3038a3">
<h2 id="orge3038a3">Scripts</h2>
<p>
Making the computer work for us. 
</p>

</section>
<section id="slide-org9c6b4af">
<h3 id="org9c6b4af">Move to the molecules folder</h3>

</section>
<section id="slide-org031cf54">
<h3 id="org031cf54">create middle.sh</h3>
<div class="org-src-container">

<pre  class="src src-unix">head -n 15 octane.pdb | tail -n 5
</pre>
</div>

<p>
to run it 
</p>
<div class="org-src-container">

<pre  class="src src-unix">bash middle.sh 
</pre>
</div>

</section>
<section id="slide-org01f1b2d">
<h3 id="org01f1b2d">let's add a variable</h3>
<div class="org-src-container">

<pre  class="src src-unix">head -n 15 "$1" | tail -n 5
</pre>
</div>

<p>
to run it 
</p>
<div class="org-src-container">

<pre  class="src src-unix">bash middle.sh octane.pdb 
</pre>
</div>

</section>
<section id="slide-org90d6437">
<h3 id="org90d6437">more variables</h3>
<div class="org-src-container">

<pre  class="src src-unix">head -n "$2" "$1" | tail -n "$3" 
</pre>
</div>

<p>
to run it 
</p>
<div class="org-src-container">

<pre  class="src src-unix">bash middle.sh octane.pdb 15 5
</pre>
</div>

</section>
<section id="slide-orgd44a83f">
<h3 id="orgd44a83f">comments for documentation</h3>
<div class="org-src-container">

<pre  class="src src-unix"># Select lines from the middle of a file.
# Usage: bash middle.sh filename end_line num_lines 
</pre>
</div>

</section>
<section id="slide-org6c218c0">
<h3 id="org6c218c0">more than one file</h3>
<p>
(a special variable "$@") 
</p>

<p>
create a new file called sorted.sh
</p>

<div class="org-src-container">

<pre  class="src src-unix"># Sort filenames by their length.
# Usage: bash sorted.sh one_or_more_filenames
wc -l "$@" | sort -n
</pre>
</div>

</section>
<section id="slide-org27ecad7">
<h3 id="org27ecad7">give it a try</h3>
<div class="org-src-container">

<pre  class="src src-unix">bash sorted.sh *.pdb ../creatures/*.dat
</pre>
</div>

</section>
<section id="slide-orgc9964c2">
<h3 id="orgc9964c2">let's fail again</h3>
<div class="org-src-container">

<pre  class="src src-unix">bash sorted.sh
</pre>
</div>

</section>
<section id="slide-org5b7512a">
<h3 id="org5b7512a">saving experiments</h3>
<div class="org-src-container">

<pre  class="src src-unix">history | tail -n 5 &gt; redo-figure-3.sh
</pre>
</div>

</section>
<section id="slide-org72c1f46">
<h3 id="org72c1f46">Back to Nelle</h3>
<p>
(and the north-pacific-gyre/2017-07-03/) 
</p>

<p>
Let's create a script do-stats.sh
</p>

</section>
